Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Flink’s HA mode relies on Apache ZooKeeper, a service for distributed coordination and consistent storage, and a persistent remote storage, such as HDFS, NFS, or S3.
zh_cn: Flink的HA模式需要依赖Apache ZooKeeper（一项可用于分布式协调和一致性存储的服务）以及某种持久化远程存储（例如HDFS、NFS或S3）。

source: Flink’s Java tuples and Row type and Scala’s built-in tuples and case classes are handled differently than user-defined POJO types.
zh_cn: Java元组、Row类型以及Scala的内置元组和样例类，与用户自定义POJO类型的处理方式有所差异。

source: Flink’s Java tuples can have up to 25 fields, with each length is implemented as a separate class—Tuple1, Tuple2, up to Tuple25.
zh_cn: 它最多可包含25个字段，每个字段长度都对应一个单独的实现类——Tuple1、Tuple2直到Tuple25。

source: Flink’s JobManager holds metadata about an application and its execution, such as the application JAR file, the JobGraph, and pointers to completed checkpoints.
zh_cn: Flink的JobManager中存放了应用以及和它执行有关的元数据，例如应用的JAR文件、JobGraph以及已完成检查点的路径信息。

source: Flink’s batch processing API, the DataSet API, and the runtime are separate from their corresponding stream‐ ing counterparts.
zh_cn: 虽然Flink用于批处理的DataSet API以及它的运行时环境都独立于对应的流处理部分，

source: Flink’s built-in window assigners create windows of type TimeWindow.
zh_cn: Flink内置窗口分配器所创建的窗口类型为TimeWindow。

source: Flink’s checkpointing algorithm produces consistent distributed checkpoints from streaming applications without stopping the whole application.
zh_cn: 虽然Flink的检查点算法能够在不停止整个应用的情况下为流式应用生成一致的分布式检查点，

source: Flink’s checkpointing algorithm uses a special type of record called a checkpoint bar‐ rier.
zh_cn: Flink的检查点算法中会用到一类名为检查点分隔符（checkpoint barrier）的特殊记录。

source: Flink’s checkpointing is enabled and all sources of the application are resettable.
zh_cn: Flink的检查点功能处于开启状态，应用所有的数据源都是可重置的。

source: Flink’s command-line client provides the functionality to start, stop, and manage Flink applications.
zh_cn: Flink命令行客户端提供了启动、停止和管理Flink应用的功能。

source: Flink’s connector for HDFS is always in the classpath of Flink.
zh_cn: 虽然Flink的HDFS连接器始终存在于Classpath中，

source: Flink’s default configuration for network buffers is sufficient for small to medium-sized setups.
zh_cn: Flink默认的网络缓冲区配置足以应对中小型设置场景。

source: Flink’s default configuration for network buffers is sufficient for small- to medium-sized set‐ ups.
zh_cn: Flink默认的网络缓冲区配置足以应对中小型使用场景。

source: Flink’s default configuration is only suitable for a smaller scale distributed setup and needs to be adjusted for more serious scale.
zh_cn: Flink默认配置仅适用于规模较小的分布式环境，若想在更"真实"的规模下使用则需要一定调整。

source: Flink’s default task scheduling strategy assigns a complete slice of a program—up to one task of each operator of an application to a single processing slot.2 Depending on the complexity of the application and the computational costs of the operators, this default strategy can overload a processing slot.
zh_cn: Flink默认任务调度策略会将一个完整的程序分片（包含每个应用算子最多一个任务）分配到一个处理槽中。2 根据应用的复杂度以及算子的计算成本，

source: Flink’s design aims to reduce synchronization points.
zh_cn: Flink的设计旨在减少同步点的数量，

source: Flink’s high-availability mode is based on Apache ZooKeeper, a system for distributed services that require coordination and consensus.
zh_cn: Flink的高可用模式是基于能够提供分布式协调和共识服务的Apache ZooKeeper系统来完成。

source: Flink’s high-level APIs and interfaces are well integrated with each other and with the DataStream and DataSet APIs so that you can easily mix them and switch between libraries and APIs in the same program.
zh_cn: Flink的高层API及接口彼此之间，以及和DataStream、DataSet API都有良好的集成，因此你可以轻松将它们混在一起使用，并在同一个程序对API或库进行自由切换。

source: Flink’s histogram is especially implemented for reporting metrics on long values.
zh_cn: Flink的直方图特别适合用来报告Long类型的指标。

source: Flink’s master and worker processes have different memory requirements.
zh_cn: Flink的主进程和工作进程对内存有着不同需求。

source: Flink’s master process is started as a YARN ApplicationMaster.5 YARN automatically restarts a failed ApplicationMaster but tracks and limits the number of restarts to pre‐ vent infinite recovery cycles.
zh_cn: Flink的主进程是作为YARN ApplicationMaster启动的。5 YARN会自动重启故障的ApplicationMaster，但会跟踪并限制重启次数以防出现无限制的恢复循环。

source: Flink’s mechanism to manually con‐ trol the assignment of tasks to slots is slot-sharing groups.
zh_cn: Flink提供了处理槽共享组（slot-sharing group）机制，允许用户手工将任务分配到处理槽中。

source: Flink’s network stack is based on the Netty library, which allocates network buffers from native (off-heap) memory.
zh_cn: Flink的网络栈基于Netty库，它会从本地（堆外）内存分配网络缓冲区。

source: Flink’s queryable state service consists of three processes:
zh_cn: Flink的可查询式状态服务包含三个进程：

source: Flink’s recovery algorithm is based on state checkpoints.
zh_cn: Flink的故障恢复算法是基于状态的检查点来完成的。

source: Flink’s recovery mechanism is based on consistent application checkpoints.
zh_cn: Flink的故障恢复机制需要基于应用的一致性检查点。

source: Flink’s recovery mechanism is based on consistent checkpoints of application state.
zh_cn: Flink的故障恢复机制需要基于应用状态的一致性检查点。

source: Flink’s relational APIs, SQL and the LINQ-style Table API, are not discussed in this book.
zh_cn: 而Flink的关系型API——SQL及LINQ风格的Table API，并没有在书中过多涉及。

source: Flink’s state backends (except for MemoryStateBackend) store checkpoints in a remote filesystem.
zh_cn: Flink的状态后端（MemoryStateBackend除外）都会将检查点存到远程文件系统中。

source: Flink’s system class loader loads all JAR files in the ./lib folder and the user-code classloaders are derived from the sys‐ tem classloader.
zh_cn: Flink的系统类加载器会从./lib目录中加载全部JAR文件，同时用户代码类加载器也是由类加载器衍生而出。

source: Flink’s type extractor leverages reflection and analyzes function signatures and subclass information to derive the correct output type of a user-defined function.
zh_cn: Flink的类型提取器会利用反射以及分析函数签名和子类信息的方式，从用户自定义函数中提取正确的输出类型。

source: Flink’s type system will automatically generate serializers that can read previous versions of the data type.
zh_cn: Flink的类型系统将自动生成可以读取之前版本数据类型的序列化器。

source: Flink’s watermark-handling and propagation algorithm ensures operator tasks emit properly aligned timestamped records and watermarks.
zh_cn: Flink的水位线处理和传播算法保证了算子任务所发出的记录时间戳和水位线一定会对齐。

source: For Java, the helper class is org.apache.flink.api.common.type info.Types, and it is used as shown in the following examples:
zh_cn: Java中的这个辅助类是org.apache.flink.api.common.typeInfo.Types，它的用法如下：

source: For a local Docker setup you have to start two types of containers, a master container that runs the Dispatcher and ResourceManager, and one or more worker containers that run the TaskManagers.
zh_cn: 对于本地Docker设置，你需要启动两类容器——一个运行Dispatcher和ResourceManager的主容器（master container）以及多个运行TaskManager的工作容器（worker container）。

source: For a sliding window, you have to specify a window size and a slide interval that defines how frequently a new window is started.
zh_cn: 对于滑动窗口而言，你需要指定窗口大小以及用于定义新窗口开始频率的滑动间隔。

source: For all actions you want to apply to a running job, you need to provide a JobID that identifies the application.
zh_cn: 为了对正在运行的作业执行任何操作，你都需要提供一个用来指定应用的JobID。

source: For an application that computes the average temper‐ ature per sensor and minute, a deterministic key could be the ID of the sensor and the timestamp for each minute.
zh_cn: 对于每分钟为每个传感器计算平均温度的应用而言，其确定的键值可以由传感器ID和每分钟的时间戳组成。

source: For applications that require very low latency and can tolerate at-least-once state guarantees, Flink can be configured to process all arriving records during buffer alignment instead of buffering those for which the barrier has already arrived.
zh_cn: 对于那些需要极低延迟且能容忍至少一次状态保障的应用，可以通过配置让Flink在分隔符对齐的过程中不缓冲那些已收到分隔符所对应分区的记录，而是直接处理它们。

source: For appli‐ cations with several partitioning steps, this quadratic dependency can quickly sum up to a significant amount of memory that is required for network transfer.
zh_cn: 而对于包含多次分区的应用，这样的平方依赖会很快占用大量的网络传输内存。

source: For batch applications, we usually care about the total execution time of a job, or how long it takes for our processing engine to read the input, perform the computation, and write back the result.
zh_cn: 对批处理应用而言，我们通常会关心作业的总执行时间，或者说处理引擎读取输入、执行计算、写回结果共需多长时间。

source: For both setups—job and session mode—failed TaskManagers will be automatically restarted by Flink’s ResourceManager.
zh_cn: 无论是作业模式还是会话模式，Flink的ResourceManager都会自动对故障的TaskManager进行重启。

source: For each checkpoint, the sink starts a transaction and appends all received records to the transaction, writing them to the sink system without committing them.
zh_cn: 每次生成检查点，数据汇都会开启一次事务并将全部收到的记录附加到该事务中，即将它们写入接收系统但先不提交。

source: For each distinct value of the key attribute, Flink maintains one state instance.
zh_cn: 对于每一个键值，Flink都会维护一个状态实例。

source: For each event in the input stream, a task is a processing step that performs the fol‐ lowing steps: (1) receives the event, storing it in a local buffer; (2) possibly updates internal state; and (3) produces an output record.
zh_cn: 对于输入流中的每个事件，任务都需要执行以下步骤：（1）接收事件并将它们存在本地缓冲区；（2）选择性地更新内部状态；（3）产生输出记录。

source: For each event in the input stream, a task performs the following steps: (1) receive the event, i.e. store it in a local buffer, (2) possibly update internal state, and (3) produce an output record.
zh_cn: 对于输入流中的每个事件，任务都需要执行以下步骤：（1）接收事件（将它们存在本地缓冲）；（2）有可能更新内部状态；（3）产生输出记录。

source: For each expired timer, the task invokes a call-back function that can perform a computation and emit records.
zh_cn: 对于每个到期的定时器，调用回调函数，利用它来执行计算和发出记录。

source: For each expired timer, the task invokes a callback function that can perform a computation and emit records.
zh_cn: 对于每个到期的计时器，调用回调函数，利用它来执行计算并发出记录。

source: For each input event, the processElement() method is called.
zh_cn: 对于每个输入事件，都会调用processElement()方法。

source: For each key and timestamp, exactly one timer can be registered, which means each key can have multiple timers but only one for each timestamp.
zh_cn: 对于每个键值和时间戳只能注册一个计时器。换言之，每个键值可以有多个计时器，但对应每个时间戳只能有一个。

source: For each operator, you can explicitly specify its slot-sharing group with the slotSharingGroup(String) method.
zh_cn: 对于每个算子，你都可以利用slotSharingGroup(String)方法为其指定处理槽共享组。

source: For each received record, the queryable state sink upserts the record into ValueState, so that the latest event per key is always
zh_cn: 对于每个收到的记录，可查询式状态的数据汇都会用它去更新ValueState的值，这样就能为每个键值保存最新的事件。

source: For every checkpoint, it starts a new transaction and
zh_cn: 对于每个检查点，它都会开启一个新的事务，

source: For exam‐ ple, the data of an order processing system can be analyzed to obtain sales growth over time, to identify reasons for delayed shipments, or to predict future sales in order to adjust the inventory.
zh_cn: 例如：通过分析订单处理系统中的数据来获知销售增长率、分析运输延迟原因、预测销售量以调整库存。

source: For example they need to be normalized, joined or enriched with additional data, or pre-aggregated, i.e., transformations that are also commonly performed by ETL processes.
zh_cn: 例如：标准化，与其他数据连接或丰富数据，预聚合等一系列在ETL过程中的常见变换。

source: For example, MapState is backed by a Java HashMap object.
zh_cn: 例如，MapState的后端其实是Java HashMap对象。

source: For example, a Kafka source needs to choose the partition offsets from which it consumes a topic if no restored read positions are available.
zh_cn: 例如：Kafka数据源会在没有可供恢复的读取位置时从它消费的主题中决定分区偏移。

source: For example, a MapFunction does
zh_cn: 例如，

source: For example, a sink operator that writes the results and updates of a keyed window operator to a key-value store could do this by overriding inaccu‐ rate results with the latest update using upsert writes.
zh_cn: 例如，为了实现此目的，一个用于将键值窗口算子的结果及更新写入键值存储的数据汇算子，可以通过Upsert写入模式将之前的非精确结果替换为最近一次更新。

source: For example, a time-window operator assigns records to windows according to their associated timestamp.
zh_cn: 例如，时间窗口算子会根据记录关联的时间戳将其分配到窗口中。

source: For example, a time-window task finalizes a window computa‐ tion and emits the result when the task event-time passes the window’s end boundary.
zh_cn: 例如：基于时间窗口的任务会在其事件时间超过窗口结束边界时确定最终的窗口进行计算并发出结果。

source: For example, a window operator can group the events of a stream into windows of 5 minutes and count for each window how many events have been received.
zh_cn: 举例而言，窗口算子可以将数据流中的事件按照每5分钟的窗口进行分组，并计算每个窗口中收到的事件数。

source: For example, a window operator registers a timer for every active window, which cleans up the window’s state when the event time passes the window’s ending time.
zh_cn: 例如：窗口算子会为每个活动窗口注册一个计时器，它们会在事件时间超过窗口的结束时间时清理窗口状态。

source: For example, an application with a sink that upserts into a key-value store must ensure that it deterministically computes the keys that are used to upsert.
zh_cn: 举例而言，如果应用中用到了一个写键值存储的数据汇，那么必须保证每次计算出的用于插入操作的键都相同。

source: For example, an assigner with a size of one hour will define windows at 00:00:00, 01:00:00, 02:00:00, and so on.
zh_cn: 例如，大小为1小时的分配器将会在00:00:00、01:00:00、02:00:00……时间定义窗口。

source: For example, an average latency value of 10 ms means that events are processed within 10 ms on average.
zh_cn: 例如：平均延迟为10毫秒表示平均每条数据会在10毫秒内处理。

source: For example, an average latency value of 10ms means that events are processed within 10ms on average.
zh_cn: 例如：平均延迟10毫秒表示平均每条数据会在10毫秒内处理。

source: For example, determining whether a specific event occurs in the input stream can be correctly realized with at-least-once guarantees.
zh_cn: 例如：确定某个事件是否在输入流中出现过，就可以利用至少一次保障正确地实现。

source: For example, file:///home/user/data.txt points to a file in the local filesystem and hdfs:///namenode:50010/home/user/data.txt to a file in the specified HDFS cluster.
zh_cn: 例如，file:///home/user/data.txt指向本地文件系统中的文件，hdfs:///namenode:50010/home/user/data.txt指向某HDFS集群中的一个文件。

source: For example, given a base path of "/johndoe/demo" and a part prefix of "part", the path "/johndoe/demo/2018-07-22--17/part-4-8" points to the eight file that was written by the fifth (0-indexed) sink task to bucket "2018-07-22--17"—the 5 p.m. bucket of July 22, 2018.
zh_cn: 例如，给定一个基础路径"/johndoe/demo"和分块文件前缀"part"，路径"/johndoe/demo/2018-07-22--17/part-4-8"指向2018年7月22日下午5点的桶内由5号（编号从0开始）数据汇任务写出的第8个文件。

source: For example, if all users in a team pop 500 bubbles within one minute, they get a level-up.
zh_cn: （例如：如果团队所有成员在一分钟内消除了500个泡泡，他们就会提升一级）。

source: For example, if you are processing a stream of measurements from a set of sensors, you can use a parti‐ tioned operator state to maintain state for each sensor independently.
zh_cn: 举例而言，如果你要处理从一组传感器得到的测量值数据流，则可以用分区算子状态（partitioned operator state）来单独维护每个传感器的状态。

source: For example, if you are processing a stream of measurements from a set of sensors, you can use partitioned operator state to maintain state for each sensor inde‐ pendently.
zh_cn: 举例而言，如果你要处理从一组传感器得到的测量值数据流，则可以用分组算子状态（partitioned operator state）来独立地维持每个传感器的状态。

source: For example, if you are the first customer showing up at the coffee shop right after it opened its doors in the morning, you will be served immediately.
zh_cn: 这就如同你是早晨咖啡店开门后的首位顾客，会立即享受服务。

source: For example, if you have a ValueState[String], Flink’s type system generates a StringSerializer to convert String objects into bytes.
zh_cn: 举例而言，如果你有一个ValueState[String]，Flink的类型系统会生成一个StringSerializer来将String对象转换成字节。

source: For example, information for a product that is offered in a webshop can be stored in a transactional database, a web cache, and a search index.
zh_cn: 例如：网店内某产品的信息可能会同时放到事务型型数据库、网站缓存以及搜索索引中。

source: For example, it can make sense to break a long pipeline of chained tasks or break a chain into two tasks to schedule an expensive function to different slots.
zh_cn: 举例而言，有时候我们需要对过长任务链接进行切分或者将两个计算量大的函数分配到不同的处理槽中。

source: For example, most operators for Flink’s SQL support are implemented using process functions.
zh_cn: 例如，大多数Flink SQL所支持的算子都是利用处理函数实现的。

source: For example, once data has been emitted to a sink, it is hard to guarantee result correctness, since the sink might not provide transactions to revert results that have been previously written.
zh_cn: 举例而言，一旦数据从数据汇中写出，结果正确性将难以保障。原因在于，数据汇可能不提供事务来恢复之前写入的结果。

source: For example, repeatedly inserting the same key-value pair into a hashmap is an idempotent operation because the first insert operation adds the value for the key into the map and all following insertions will not change the map since it already
zh_cn: 例如，将相同的键值对插入一个哈希映射就是一个幂等操作。因为在首次将键值对插入映射中后，无论该操作再重复几次都不会改变这个映射，因为目标键值对已经存在了。

source: For example, sink functions that aim to write data to external systems with exactly-once guarantees must only emit records that were received before a successful checkpoint to ensure the received data will not be recomputed in the case of a failure.
zh_cn: 例如：数据汇函数为了以精确一次语义将数据写入外部系统，只能发出那些在检查点成功创建前收到的记录。这样做是为了保证在出现故障时不会重复发送接收的数据。

source: For example, the Cassandra sink connector by default uses a Check pointCommitter that writes to Cassandra.
zh_cn: 举例而言，Cassandra数据汇连接器默认情况下会使用一个将信息写入Cassandra的CheckpointCommitter。

source: For example, the FileSystem state backend and the RocksDB state backend support asynchronous checkpoints.
zh_cn: 举例而言，文件系统状态后端和RocksDB状态后端支持异步生成检查点。

source: For example, the data of an order processing system can be analyzed to obtain sales growth over time, to identify reasons for delayed shipments, or to predict future sales in order to adjust the inventory.
zh_cn: 例如：通过分析订单处理系统中的数据来获知销售增长率，通过分析运输延迟原因或预测销售量以调整库存。

source: For example, the default triggers of the pre‐ viously discussed time windows fire when the processing time or the watermark exceed the timestamp of the window’s end boundary.
zh_cn: 对之前讨论的时间窗口而言，其默认触发器会在处理时间或水位线超过了窗口结束边界的时间戳时触发。

source: For example, the following Java class will be identified as a POJO by Flink:
zh_cn: 例如，以下Java类就会被Flink识别为POJO：

source: For example, the queryable state is only accessible while the application is running.
zh_cn: 例如：它只有在应用运行过程中才可以访问。

source: For example, the start scripts, such as ./bin/start-cluster.sh, parse the configuration file to extract JVM parameters and heap size settings, and the CLI client (./bin/flink) extracts the connection information to access the master process.
zh_cn: 举例而言，启动脚本（如./bin/start-cluster.sh）会解析该配置文件获得JVM参数以及堆大小设置，CLI客户端（./bin/flink）会从中获得连接信息以访问主进程。

source: For example, to finalize windows when the event-time passes their end boundaries, a time-window task registers a timer for the ending time of each of its active windows.
zh_cn: 例如：为了在事件时间越过结束边界时最终确定窗口，时间窗口任务会根据当前活动窗口的结束时间注册定时器。

source: For example, transactional sinks commit changes to external systems when a savepoint completes.
zh_cn: 例如，事务性数据汇在保存点完成后会将修改提交到外部系统。

source: For example, user interactions with a series of news articles one after the other could be considered a session.
zh_cn: 例如：用户浏览一连串新闻文章的交互过程可以看作一个会话。

source: For example, with RocksDBStateBackend it is more efficient to use MapState[X, Y] instead of ValueState[HashMap[X, Y]].
zh_cn: 例如，针对RocksDBStateBackend，使用MapState[X, Y]要比ValueState[HashMap[X, Y]更高效。

source: For example, you can configure that an applica‐ tion be restarted as long as it did not fail more than three times in the last ten minutes.
zh_cn: 例如，你可以配置应用只要在过去十分钟内失败次数没超过三次，就可以一直重启。

source: For example, you can configure the maximum number of failed containers until an application is terminated.
zh_cn: 例如，可以配置有多少容器发生故障后终止应用。

source: For example, you can implement triggering logic to fire when the window receives a certain number of elements, when an ele‐ ment with a specific value is added to the window, or after detecting a pattern on added elements like “two events of the same type within 5 seconds.” A custom trigger can also be used to compute and emit early results from an event-time window, before the watermark reaches the window’s end timestamp.
zh_cn: 举例而言，你可以在触发器中实现以下触发逻辑：当窗口接收到一定数量的元素，当含有某个特定值的元素加入窗口，或当检测到添加的元素满足某种模式（如5秒内出现了两个相同类型的事件）。自定义触发器还可以用来在水位线到达窗口的结束时间戳以前，为事件时间窗口计算并发出早期结果。

source: For filesystems for which Flink does not provide a dedicated connector, Flink can del‐ egate to the Hadoop filesystem connector if it is correctly configured.
zh_cn: 对于那些在Flink中没有提供特定连接器支持的文件系统，如果正确配置，Flink都能以Hadoop文件系统连接器为代理对其进行操作。

source: For instance, Kafka 0.10 added support for record timestamps.
zh_cn: 例如，Kafka 0.10增加了对记录时间戳的支持。

source: For instance, a time-window operator task attaches the end time of a window as the timestamp to all records emitted by the window computation before it emits the watermark with the timestamp that triggered the computation of the window.
zh_cn: 举例而言，时间窗口算子任务会在发送触发窗口计算的水位线时间戳之前，将所有经过窗口计算所得结果的时间戳设为窗口的结束时间。

source: For instance, assume you join two streams with a join operator that is configured with 1-hour tumbling window.
zh_cn: 例如，假设你为执行Join操作的算子配置了1小时的滚动窗口，

source: For instance, event logs like Apache Kafka can provide records from a previous offset of the stream.
zh_cn: 例如，类似Apache Kafka的事件日志系统就允许从之前的某个偏移读取记录。

source: For instance, if we are using a dis‐ tributed processing engine, each operator might have several parallel tasks running on different physical machines.
zh_cn: 例如：当我们使用分布式处理引擎，每个算子可能会在不同物理机器上运行多个并行任务。

source: For instance, if we are using a distributed processing engine, each operator might have several parallel tasks running on different physical machines.
zh_cn: 例如：当我们使用分布式处理引擎时，每个算子可能会在不同物理机器上运行多个并行任务。

source: For instance, if you are receiving meas‐ urements from different sensors, you probably want to group the stream by sensor id before applying a window computation.
zh_cn: 例如，如果你在收集来自不同传感器的测量值，那么可能会想在应用窗口计算前按照传感器id对数据流进行划分。

source: For instance, if you are receiving measurements from different sensors, you probably want to group the stream by sensor ID before applying a window computation.
zh_cn: 例如，如果你在收集来自不同传感器的测量值，那么可能会想在应用窗口计算前按照传感器ID对数据流进行划分。

source: For instance, in a stand-alone setup, i.e., a setup without a resource provider, the ResourceManager can only distribute the slots of available TaskManagers and cannot start new TaskManagers on its own.
zh_cn: 例如：独立集群设置中没有资源提供者，因此ResourceManager只能分配现有TaskManager中的处理槽而无法自己启动新的TaskManager。

source: For instance, in a standalone setup—a setup without a resource provider—the ResourceManager can only distribute the slots of available TaskManagers and cannot start new TaskManag‐ ers on its own.
zh_cn: 例如：独立集群设置下没有资源提供者，因此ResourceManager只能分配现有TaskManager中的处理槽而无法自己启动新的TaskManager。

source: For instance, reducing the overhead of each checkpoint can facilitate a higher checkpointing frequency, leading to faster recovery cycles.
zh_cn: 举例而言，减小每次检查点的生成开销可以促使其频率加快，从而使恢复周期缩短。

source: For instance, the RocksDB state backend supports incremental checkpoints, which can significantly reduce the checkpointing overhead for very large state sizes.
zh_cn: 例如：RocksDB状态后端支持增量检查点。这对于大规模的状态而言，会显著降低生成检查点的开销。

source: For instance, the following line sets the root logging level to “warning”:
zh_cn: 例如，下面一行配置会将根日志记录级别设置为"warning"：

source: For instance, the name “myCounter,” the user scope “MyMetrics,” and the system scope “localhost.taskmanager.512” would result into the identifier “localhost.task‐
zh_cn: 举例而言，指标名称"myCounter"、用户域"MyMetrics"和系统域"localhost.taskmanager.512"将会生成标识"localhost.taskmanager.512.MyMetrics"。

source: For instance, you could extract patterns from a Data‐ Stream using the CEP library and later use SQL to analyze extrac‐ ted patterns or you could use the Table API to filter and project tables into graphs before analyzing them with a graph algorithm from the Gelly library.
zh_cn: 例如，你可以使用CEP从DataStream中提取某一模式，随后用SQL来分析该模式，或者先用Table API对表进行过滤并投影到图中，再使用Gelly库中的图算法对其进行分析。

source: For instance, you could implement a FlatMapFunction that emits each incoming
zh_cn: 例如，你可以在FlatMapFunction内用HTTP POST请求发出记录，而非自身提供的Collector。

source: For instance, you might be interested in measuring how the stream is observed and count events per second in order to detect possible outages.
zh_cn: 例如，你可能会有兴趣监测数据流的接入情况或通过计算每秒事件数来发现潜在的数据中断。

source: For instance, you might be interested in observing the stream and counting the number of events per second to detect outages.
zh_cn: 例如，你可能想观察数据流的接入情况，通过计算每秒事件数来检测数据中断。

source: For instance, you might want to know how many vehicles cross an intersection every 5 minutes.
zh_cn: 例如，你可能想了解某路口每5分钟的车流量。
